// Запуск роутера и смена имени
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname Router3

// Настрйока порта i31
Router3(config)#interface Serial 2/0
Router3(config-if)#ip address 8.1.1.2 255.255.255.0
Router3(config-if)#no shut
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up
Router3(config-if)#exit

// Настрйока порта i32
Router3(config)#interface FastEthernet 1/0
Router3(config-if)#ip address 8.1.3.2 255.255.255.0
Router3(config-if)#no shut
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
Router3(config-if)#exit

// Сохранение настроек
Router3(config)#exit
%SYS-5-CONFIG_I: Configured from console by console
write
Building configuration...
[OK]
Router3#